tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "cmake"
brew "curl"
brew "icarus-verilog"
brew "neofetch"
brew "openfpgaloader"
brew "speedtest-cli"
brew "youtube-dl"
brew "mas"
brew "nmap"
brew "docker-compose"
brew "jq"
brew "aria2"
brew "tmux"

cask "airbuddy"
cask "altserver"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "bartender"
cask "bbedit"
cask "betterdisplay"
cask "cyberduck"
cask "docker"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "forecast"
cask "google-chrome"
cask "grandperspective"
cask "handbrake"
cask "istat-menus"
cask "iterm2"
cask "numi"
cask "parallels"
cask "playcover-community"
cask "postman"
cask "raycast"
cask "shottr"
cask "spotify"
cask "tailscale"
cask "virtualbuddy"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "xcodes"
cask "zoom"

mas "1Blocker", id: 1365531024
mas "Baking Soda", id: 1601151613
mas "Bluetooth Inspector", id: 1509085044
mas "Craft", id: 1487937127
mas "DevCleaner", id: 1388020431
mas "Dropover", id: 1355679052
mas "GoodLinks", id: 1474335294
mas "GoodNotes", id: 1444383602
mas "Hand Mirror", id: 1502839586
mas "HextEdit", id: 1557247094
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Mela", id: 1568924476
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pi-hole Remote", id: 1515445551
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Vinegar", id: 1591303229
