brew tap majd/repo
brew tap homebrew/cask-fonts

brew "docker-compose"
brew "icarus-verilog" # verilog sim
brew "neofetch" # pretty
brew "odmpy" # Libby ftw
brew "openfpgaloader" # flash FPGAs with bitsreams
brew "yt-dlp"
brew "aria2"
brew "bottom" # super nice diagonstic panel

cask "airbuddy"
cask "altserver"
cask "arc"
cask "asset-catalog-tinkerer"
cask "balenaetcher"
cask "bartender"
cask "betterdisplay"
cask "bunch"
cask "docker"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "forecast"
cask "gtkwave"
cask "grandperspective"
cask "handbrake"
cask "iterm2"
cask "latest"
cask "launchcontrol"
cask "mouse-fix"
cask "netnewswire"
cask "numi"
cask "onyx"
cask "parallels"
cask "playcover-community"
cask "raycast"
cask "sf-symbols"
cask "shottr"
cask "sloth"
cask "spotify"
cask "tailscale"
cask "utm"
cask "visual-studio-code"
cask "wiresharks"
cask "xcodes"
cask "zoom"

mas "1Blocker", id: 1365531024
mas "Baking Soda", id: 1601151613
mas "Broadcasts", id: 1469995354
mas "Craft: Write docs, AI editing", id: 1487937127
mas "DevCleaner", id: 1388020431
mas "GoodNotes", id: 1444383602
mas "HextEdit", id: 1557247094
mas "iStat Menus", id: 1319778037
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
# mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "Velja", id: 1607635845
mas "Vinegar", id: 1591303229
mas "WorldWideWeb – Desktop", id: 1621370168
